semestr1/logika/rachunek-kwantyfikatorow.md

# Table of Contents

1.  [wazni mysliciele](#org1d0bda3)
2.  [kwantyfikator](#org42a0628)
3.  [funkcje zdaniowe](#org2c2e23f)
        1.  [zmienna wolna](#org8edc75f)
        2.  [kwanytyfikatory wiążą mocniej niż spójniki](#orgc173dcc)



<a id="org1d0bda3"></a>

# wazni mysliciele

-   david hilbert, ackerman,


<a id="org42a0628"></a>

# kwantyfikator

-   naleza do stalych logicznych
-   odpowiadaja zaimkom
-   symbole (w krz ?)
    -   funktory
    -   nawiasy
    -   zmienne indywiduowe
    -   stale indywiduowe (indywidualne)
-   symbole predykatowe (orzeczenia)
    -   funktory P Q R S
    -   kwantyfikator ogolny - dla wszystkich, dla kazdego
    -   kwantyfikator szczegolny - istnieje taki ze


<a id="org2c2e23f"></a>

# funkcje zdaniowe

-   P(x), Q(x), R(x, y), S(x, y)
-   P, Q, R, S - zdania orzeczeniowe
-   gdy podstawimy zmienne indywiduowe z funkcji zdaniowych otrzymujemy zdania
    -   funkcja(zmienna) = zdanie


<a id="org8edc75f"></a>

### zmienna wolna

-   zmienna poza zasięgiem kwantyfikatorów


<a id="orgc173dcc"></a>

### kwanytyfikatory wiążą mocniej niż spójniki

